<template>
  <div class="home">
    <div class="topic">
      <h2>

      </h2>
    </div>
    <div class="container">
      <h3>
        О Проекте
      </h3>
      <p>
        Владивосток – морской город, нам захотелось, чтобы в Центре Развития Робототехники появились морские роботы. Во всем мире такие роботы пытаются бороздить океаны, у одних (Rutgers University с глайдером Scarlet Knight)  получилось пересечь Атлантику, другие (команда энтузиастов во главе с инженером Дэймоном МакМилланом Damon McMillan, и их SeaCharger Oceangoing Autonomous Boat) в этом году пересекали Тихий Океан, и у них почти получилось!
        Сумеем  ли мы сами создать опытный образец морской робототехники, сможет ли безэкипажное плавсредство (Unmanned surface vehicles - USV) нами задуманное, самостоятельно спроектированное и построенное выполнить настоящий переход на море?
        Юг Приморья хорошо известен множеством живописных островов больших и маленьких. Обойти автономно вокруг одного из них или даже нескольких разных, интересная задача, которая возможно выведет нас к трансокеанским путешествиям или, уж точно, даст лучше изучить родной край, узнать больше о мореплавании, навигации, течениях, ветрах и волнах.
      </p>

    </div>
    <div class=" wrapper">
      <div class="container">
        <div class="row">
          <div class="col-lg-12">
            <icon class="icon" name="ship"></icon>
            <h5 class="icon-color">
              Идея
            </h5>
            <p>
              Робот – система способная самостоятельно выполнять работу, достигая результата. На море, такая работа, в простейшем случае, это мореплавание, т.к. основным видом технологического процесса работы настоящего морского судна является его рейс. Рейсы бывают разные, грузовые, научные и идеи их автоматизировать появились относительно давно, но только в последние годы аппаратно-программные средства для построения систем автоматики стали доступны школьникам и студентам.
            </p>
          </div>
          <div class="col-lg-12">
            <icon class="icon" name="font-awesome"></icon>
            <h5 class="icon-color">
              Цели
            </h5>
            <p>
              Овладеть азами разработки мобильных систем, сделать морского робота, поручить этому роботу простейшую работу на море, рассказать об этом другим участникам «кружкового движения».
            </p>
          </div>
          <div class="col-lg-12">
            <icon class="icon" name="anchor"></icon>
            <h5 class="icon-color">
              Яхты-роботы
            </h5>
            <p>
              Желание Центра развития робототехники углубится в морскую тематику уже реализовывалось в организации городских соревнований яхт-роботов впервые прошедших во Владивостоке на акватории озера Юность  в сентябре 2014 г. Эта инициатива встретила тогда понимание и поддержку, как городских властей, так и представителей высшего образования, Морского государственного университета имени адмирала Г.И. Невельского.
              Школьники, вовлеченные в техническое творчество, позже приняли участие в 62-й Международной молодежной научно-технической конференции «Молодежь. Наука. Инновации». Старшеклассница Юлия Ренева, выступавшая с докладом «Опыт модернизации радиоуправляемой яхты для соревнований яхт-роботов» впоследствии поступила в ВШЭ.
            </p>
          </div>
        </div>
      </div>
    </div>
    <div class="container ">
      <b-card class="card-history ">
        <div class="row">
          <img class="col-lg-6" src="../../static/pernov.jpg">
          <div class="col-lg-6">
            <p style="font-size: 14pt">
              В конце XIX — начале XX в. появились крошечные по сравнению с тогдашними броненосцами корабли — носители торпед, названные миноносками.Применение торпед требовало скорости и маневренности, что было весьма непросто с паровыми машинами того времени. Конструкция миноносок, а некоторые были менее 20 метров длиной, подвергалась тщательной оптимизации, чтобы достигать максимальной скорости и мореходности.
            </p>
            <p style="font-size: 14pt">
              При выборе формы корпуса нашего морского робота было решено остановится на модели миноносца проекта «Пернов», которых в Российской Империи было построено 24 еденицы, а 4 служили непосредственно во Владивостоке в период Русско-японской войны, причем остов одного и них (№ 208) до сих пор (с 1904 г.) находится в заливе Петра Великого недалеко от о-ва Скрыплева.
              Наша модель - безэкипажное плавстредство называется Пернов-А (Автономный), в честь того корабля, погибшего защищая город.
            </p>
          </div>
        </div>
      </b-card>
    </div>
  </div>

</template>

<script>
  import Icon from "../../node_modules/vue-awesome/components/Icon";

  export default {
    components: {Icon},
    name: 'home',
    data () {
      return {
        access_token: ""
      }
    },
    mounted() {
//      this.$store.dispatch('fetch_position_list')
    }
  }
</script>

<style scoped>
  .icon {
    height: 30px;
    width: 30px;
    /*color: #00abcc;*/
    color:#00365f;
  }

  .topic {
    background-image: url(../../static/bg_board.png);
    background-repeat: no-repeat;
    background-position: center;
    min-height: 311px;
  }

  .wrapper {
    padding: 20px 0;
    /*background-color: black;*/
    color: black;
  }

  h2 {
    padding-top: 100px;
    color: white;
    font-weight: 200;
  }

  .pernov_img {
    flex: 1;
    max-width: 100px;
  }

  .card-history {
    display: flex;
    flex-direction: row;
  }

  .card-history-text {
    flex: 2;
  }

  .gray {
    background-color: gray;

  }
  .icon-color {
    color:#00365f;
    /*color: #00abcc*/
  }
  p {
    text-align: justify;
  }
</style>
